# Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.
# Нельзя юзать find или count.

a = input('Введите предложение: ')
b = input('Введите слово: ')
print(b in a)